GCControlScope.s_nestLevel
Support nesting to avoid unnecessary multiple cleanups.

GCControlScope.s_bForceCollection
controls if garbage collection should be forced in addition to Revit Application Hospice purge.

GCControlScope.unblockFinalizers
Utility to allow unblocking of finalizers when necessary. Useful as part
of scope exit and also used as part of non-UI Revit to have a way to allow GC to be unblocked.

GCControlScope.Dispose
Exit of the scope, will clear the global RevitApplication hospice, if application exists, in addition
will force global garbage collection if requested.

GCControlScope.#ctor(System.Boolean)
start of scope.
bForceCollection: true to force garbage collection, so that in addition to hospice purge, global collection will occur.

GCControlScope
A scope that when exited, will purge the global RevitApplication hospice of native objects collected
to be deleted.  To force additional global garbage collection, initialize the scope indicating the desire,
such as at shutdown.
Remarks:
The scope supports nesting, with global garbage collection forced if ANY scope along
the nesting chain requested it.